In [12]:
# pip install pymysql
import pandas as pd
import pymysql
import sqlalchemy

### import data file excel

In [10]:
df1 = pd.read_excel('mtcars.xlsx',sheet_name='Sheet1')

In [11]:
df1.head()

,Merek,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

### import data file csv

In [39]:
df2 = pd.read_csv('mtcars.csv')

In [40]:
df2.head()

,Merek,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

### import data MySQL Format

In [ ]:
# Not Running
# Config Database bisa dimodif
host = 'aurora.com'
port = '3306'
user = 'andromeda'
password = '12345'
database = 'galaxy'

connAurora = pymysql.connect(
    host=host,
    port=int(port),
    user=user,
    passwd=password,
    db=database,
    charset='utf8mb4')

In [ ]:
# Not Running
query = """
SELECT * FROM tblclients WHERE province = 'East Java'
"""
df3 = pd.read_sql_query(query,connAurora)

### import data from google sheet

In [14]:
import gspread
from oauth2client.service_account import ServiceAccountCredentials

import pandas as pd

In [15]:
scope = ['https://spreadsheets.google.com/feeds', 'https://www.googleapis.com/auth/drive'] # google sheet
creds = ServiceAccountCredentials.from_json_keyfile_name('APIGoogleSheet-c655a52ad934.json',scope) # import credential user
client = gspread.authorize(creds)

In [16]:
# Find a workbook by name and open the first sheet
# Make sure you use the right name here.
sheet = client.open("mtcars")
worksheet = sheet.worksheet("Sheet1")

In [17]:
# Extract and print all of the values
list_of_hashes = worksheet.get_all_records()
df4 = pd.DataFrame(list_of_hashes)

In [19]:
df4.head()

,Merek,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.62,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,3.00,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.32,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.00,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.44,17.02,0,0,3,2

### Export Data to Excel

In [42]:
df1.to_csv('mtcars2.csv',index=False)

In [41]:
df1.to_excel('mtcars2.xlsx',index=False)

### Export data to MySQL DB

In [ ]:
## Not Running
## Cara 1 (data perlu diubah ke format list)
data = df1.values.tolist()
sqlinsert = "INSERT INTO tblclients (id,firstname,lastname,city,province) VALUES (%s,%s,%s,%s,%s)"
mycursor = connAurora.cursor() 
mycursor.executemany(sqlinsert,data)

connAurora.commit()
connAurora.close()
mycursor.close()

In [ ]:
## Not Running
## cara 2 (tidak disarankan karena hanya bisa replace,tipe data di DB MySQL mungkin berubah)
## dibutuhkan data dalam bentuk dataframe
host = 'aurora.com'
port = '3306'
user = 'andromeda'
password = '12345'
database = 'galaxy'

engine = sqlalchemy.create_engine('mysql+pymysql://'+user+':'+password+'@'+host+':'+port+'/'+database+'')
#engine = sqlalchemy.create_engine('mysql+pymysql://andromeda:12345@aurora.com:port/database')

df1.to_sql(
    name='tblgalaxy', #nama tabel target di Mysql
    con=engine,
    index = False,
    if_exists = 'append' # data baru akan di append (tidak insert update)
)